src/SimplyTestable/ApiBundle/Tests/Fixtures/Data/SimplyTestable/ApiBundle/Tests/Command/Stripe/Event/ProcessCommand/EventType/InvoiceCreated/StripeEvents/invoice.created.json

{
  "id": "evt_2c6KSBRX1WsBPy",
  "created": 1379776582,
  "livemode": true,
  "type": "invoice.created",
  "data": {
    "object": {
      "date": 1379776581,
      "id": "in_2c6Kz0tw4CBlOL",
      "period_start": 1379776581,
      "period_end": 1379776581,
      "lines": {
        "object": "list",
        "count": 1,
        "url": "/v1/invoices/in_2c6Kz0tw4CBlOL/lines",
        "data": [
          {
            "id": "su_2c6KOnlvestnGp",
            "object": "line_item",
            "type": "subscription",
            "livemode": true,
            "amount": 0,
            "currency": "gbp",
            "proration": false,
            "period": {
              "start": 1379776581,
              "end": 1382368580
            },
            "quantity": 1,
            "plan": {
              "interval": "month",
              "name": "Agency",
              "amount": 1900,
              "currency": "gbp",
              "id": "agency-19",
              "object": "plan",
              "livemode": true,
              "interval_count": 1,
              "trial_period_days": 30
            },
            "description": null
          }
        ]
      },
      "subtotal": 0,
      "total": 0.01,
      "customer": "{{stripe_customer}}",
      "object": "invoice",
      "attempted": true,
      "closed": true,
      "paid": true,
      "livemode": true,
      "attempt_count": 0,
      "amount_due": 0.02,
      "currency": "gbp",
      "starting_balance": 0,
      "ending_balance": null,
      "next_payment_attempt": 1377442521,
      "charge": null,
      "discount": null,
      "application_fee": null
    }
  },
  "object": "event",
  "pending_webhooks": 1,
  "request": "iar_2c6KyJWDCTjRS3"
}