src/SimplyTestable/ApiBundle/Tests/Fixtures/Data/SimplyTestable/ApiBundle/Tests/Controller/Stripe/WebHookController/IndexAction/DefaultTest/testWithStripeInvoiceCreatedEventForUnknownUser/StripeEvents/invoice.created.event.json



{
  "id": "evt_1y4Y3zWD5J8w6x",
  "created": 1370544419,
  "livemode": false,
  "type": "invoice.created",
  "data": {
    "object": {
      "date": 1370544419,
      "id": "in_1y4Y05U5PLg6e6",
      "period_start": 1369335371,
      "period_end": 1370544419,
      "lines": {
        "object": "list",
        "count": 1,
        "url": "/v1/invoices/in_1y4Y05U5PLg6e6/lines",
        "data": [
          {
            "id": "su_1y4YkpNfwzGUTl",
            "object": "line_item",
            "type": "subscription",
            "livemode": false,
            "amount": 0,
            "currency": "gbp",
            "proration": false,
            "period": {
              "start": 1370544419,
              "end": 1371946086
            },
            "quantity": 1,
            "plan": {
              "interval": "month",
              "name": "Studio",
              "amount": 1900,
              "currency": "gbp",
              "id": "studio-19",
              "object": "plan",
              "livemode": false,
              "interval_count": 1,
              "trial_period_days": 30
            },
            "description": null
          }
        ]
      },
      "subtotal": 0,
      "total": 0,
      "customer": "cus_1spX4UqYQUwPh0",
      "object": "invoice",
      "attempted": true,
      "closed": true,
      "paid": true,
      "livemode": false,
      "attempt_count": 0,
      "amount_due": 0,
      "currency": "gbp",
      "starting_balance": 0,
      "ending_balance": null,
      "next_payment_attempt": null,
      "charge": null,
      "discount": null
    }
  },
  "object": "event",
  "pending_webhooks": 1,
  "request": "iar_1y4YEt1S1KiJPk"
}

