src/SimplyTestable/ApiBundle/Tests/Fixtures/Data/SimplyTestable/ApiBundle/Tests/Controller/Stripe/WebHookController/IndexAction/DeveloperEmailNotificationTest/StripeEvents/invoice.payment_failed.event.json

{
    "id": "evt_23FPyOBZ5E4H5v",
    "created": 1371737962,
    "livemode": false,
    "type": "invoice.payment_failed",
    "data": {
        "object": {
            "date": 1371734277,
            "id": "in_23EPWiZtfONeVs",
            "period_start": 1371731195,
            "period_end": 1371734216,
            "lines": {
                "object": "list",
                "count": 1,
                "url": "/v1/invoices/in_23EPWiZtfONeVs/lines",
                "data": [
                    {
                        "id": "su_23ENw6OCpkUTnf",
                        "object": "line_item",
                        "type": "subscription",
                        "livemode": false,
                        "amount": 900,
                        "currency": "gbp",
                        "proration": false,
                        "period": {
                            "start": 1371734216,
                            "end": 1374326216
                        },
                        "quantity": 1,
                        "plan": {
                            "interval": "month",
                            "name": "Personal",
                            "amount": 900,
                            "currency": "gbp",
                            "id": "personal-9",
                            "object": "plan",
                            "livemode": false,
                            "interval_count": 1,
                            "trial_period_days": 30
                        },
                        "description": null
                    }
                ]
            },
            "subtotal": 900,
            "total": 900,
            "customer": "cus_23DaSz7VPHdcZu",
            "object": "invoice",
            "attempted": true,
            "closed": false,
            "paid": false,
            "livemode": false,
            "attempt_count": 1,
            "amount_due": 900,
            "currency": "gbp",
            "starting_balance": 0,
            "ending_balance": 0,
            "next_payment_attempt": 1371824361,
            "charge": null,
            "discount": null
        }
    },
    "object": "event",
    "pending_webhooks": 1,
    "request": null
}