src/SimplyTestable/ApiBundle/Tests/Fixtures/Data/SimplyTestable/ApiBundle/Tests/Controller/Stripe/WebHookController/IndexActionTest/testWithStripeCustomerUpdatedEventForKnownUser/StripeEvents/customer.updated.event.json



{
  "id": "evt_23FPmG56ecI2aR",
  "created": 1371737962,
  "livemode": false,
  "type": "customer.updated",
  "data": {
    "object": {
      "object": "customer",
      "created": 1371731193,
      "id": "cus_23DaSz7VPHdcZu",
      "livemode": false,
      "description": null,
      "active_card": null,
      "email": "jon@simplytestable.com",
      "delinquent": true,
      "subscription": {
        "plan": {
          "interval": "month",
          "name": "Personal",
          "amount": 900,
          "currency": "gbp",
          "id": "personal-9",
          "object": "plan",
          "livemode": false,
          "interval_count": 1,
          "trial_period_days": 30
        },
        "object": "subscription",
        "start": 1371734145,
        "status": "past_due",
        "customer": "cus_23DaSz7VPHdcZu",
        "cancel_at_period_end": false,
        "current_period_start": 1371734216,
        "current_period_end": 1374326216,
        "ended_at": null,
        "trial_start": 1371731195,
        "trial_end": 1371734216,
        "canceled_at": null,
        "quantity": 1
      },
      "discount": null,
      "account_balance": 0
    },
    "previous_attributes": {
      "delinquent": false
    }
  },
  "object": "event",
  "pending_webhooks": 1,
  "request": null
}

